#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
data.terraform_remote_state.vpc: Reading...
data.terraform_remote_state.vpc: Read complete after 2s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.additional will be created
  + resource "aws_security_group" "additional" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/8",
                  + "172.16.0.0/12",
                  + "192.168.0.0/16",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "ex-sg-additional"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Example"    = "ex-sg"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + tags_all               = {
          + "DeployedBy"       = "Terraformm"
          + "Description"      = "For General Purposes"
          + "Environment"      = "Development"
          + "Example"          = "ex-sg"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "Termination date" = "Permanent"
          + "Type"             = "Networking"
        }
      + vpc_id                 = "vpc-08899f587b094b7f8"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + sg_id = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

</details>

Results for commit: d9345800bc05277fdb862ea4bbacf6b74f63e402

*Pusher: @vvvegero97, Action: `pull_request`, Working Directory: `eu-north-1/networking/sg`, Workflow: `Terraform CI/CD`*